; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v5 - type_1 ?v2 - type_3)
 	      (pred_1 ?v4 - object ?v2 - type_3)
	      (pred_2 ?v5 - type_1 ?v7 - type_2)
	      (pred_4 ?v5 - type_1 ?v4 - object ?v7 - type_2))

   (:action op_2
       :parameters  (?v5 - type_1 ?v8 ?v3 - type_3)
       :precondition (and  (pred_3 ?v5 ?v8))
       :effect (and  (pred_3 ?v5 ?v3)
		     (not (pred_3 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_1 ?v6 - object ?v1 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v1) (pred_3 ?v5 ?v1) (pred_2 ?v5 ?v7))
       :effect (and (pred_4 ?v5 ?v6 ?v7)
		    (not (pred_1 ?v6 ?v1)) 
		    (not (pred_2 ?v5 ?v7))))

   (:action op_3
       :parameters (?v5 - type_1 ?v6 - object ?v1 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v6 ?v7) (pred_3 ?v5 ?v1))
       :effect (and (pred_1 ?v6 ?v1)
		    (pred_2 ?v5 ?v7)
		    (not (pred_4 ?v5 ?v6 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_07 obj_06 - type_1
obj_10 obj_09 obj_01 obj_08 - type_2
obj_05 obj_03 obj_12 - type_3
obj_11 obj_04 obj_02 - object)
(:init
(pred_3 obj_07 obj_05)
(pred_2 obj_07 obj_10)
(pred_2 obj_07 obj_09)
(pred_3 obj_06 obj_12)
(pred_2 obj_06 obj_01)
(pred_2 obj_06 obj_08)
(pred_1 obj_11 obj_05)
(pred_1 obj_04 obj_12)
(pred_1 obj_02 obj_12)
)
(:goal
(and
(pred_1 obj_11 obj_12)
(pred_1 obj_04 obj_05)
(pred_1 obj_02 obj_12)
)
)

(:constraints
  (always (not (pred_3 obj_07 obj_12)))
)
)

; plan
1. (op_2 obj_07 obj_05 obj_03)
   deleted: (pred_3 obj_07 obj_05)
   added: (pred_3 obj_07 obj_03)
   goals met: 1 of 3
2. (op_1 obj_06 obj_04 obj_12 obj_08)
   deleted: (pred_1 obj_04 obj_12) (pred_2 obj_06 obj_08)
   added: (pred_4 obj_06 obj_04 obj_08)
   goals met: 1 of 3
3. (op_2 obj_06 obj_12 obj_05)
   deleted: (pred_3 obj_06 obj_12)
   added: (pred_3 obj_06 obj_05)
   goals met: 1 of 3
4. (op_3 obj_06 obj_04 obj_05 obj_08)
   deleted: (pred_4 obj_06 obj_04 obj_08)
   added: (pred_1 obj_04 obj_05) (pred_2 obj_06 obj_08)
   goals met: 2 of 3
5. (op_1 obj_06 obj_11 obj_05 obj_01)
   deleted: (pred_1 obj_11 obj_05) (pred_2 obj_06 obj_01)
   added: (pred_4 obj_06 obj_11 obj_01)
   goals met: 2 of 3
6. (op_2 obj_06 obj_05 obj_12)
   deleted: (pred_3 obj_06 obj_05)
   added: (pred_3 obj_06 obj_12)
   goals met: 2 of 3
7. (op_3 obj_06 obj_11 obj_12 obj_01)
   deleted: (pred_4 obj_06 obj_11 obj_01)
   added: (pred_1 obj_11 obj_12) (pred_2 obj_06 obj_01)
   goals met: 3 of 3
